DataProcessors/ПроверкаИКорректировкаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ПроверкаИКорректировкаДанных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Исправлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьРезультат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохраненияРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Проверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаНастроек</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяЗаполнитьНастройки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КартинкаНастройки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастройки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресВременныеДанные</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исправление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбнаруженыПроблемы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеРезультата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличныйДокумент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ПроверкаИКорректировкаДанных/Forms/Результат/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Параметры.Заголовок;
	Элементы.ДекорацияПредставлениеРезультата.Заголовок = Параметры.ПредставлениеРезультата;
	
	Если ЗначениеЗаполнено(Параметры.ТабличныйДокумент) Тогда
		
		ИмяСправочника = "ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы";
		Если Метаданные.Справочники.Найти(ИмяСправочника) <> Неопределено
			И ТипЗнч(Параметры.ТабличныйДокумент) = Тип("СправочникСсылка." + ИмяСправочника) Тогда
			
			НачатьТранзакцию();
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Параметры.ТабличныйДокумент);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			Попытка
				Блокировка.Заблокировать();
			Исключение
				ОтменитьТранзакцию();
				ВызватьИсключение СообщениеФайлУдален();
				ОписаниеОшибки = ОписаниеОшибки();
			КонецПопытки;
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", Параметры.ТабличныйДокумент);
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы.Ссылка
			|ИЗ
			|	Справочник.ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы КАК ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы
			|ГДЕ
			|	ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы.Ссылка = &Ссылка";
			Если Запрос.Выполнить().Пустой() Тогда
				ОтменитьТранзакцию();
				ВызватьИсключение СообщениеФайлУдален();
			КонецЕсли;
			
			ТабличныйДокумент = ПроверкаИКорректировкаДанных.ТабличныйДокументИзПрисоединенногоФайла(Параметры.ТабличныйДокумент);
			ОтменитьТранзакцию();
			
		ИначеЕсли ЭтоАдресВременногоХранилища(Параметры.ТабличныйДокумент) Тогда
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("mxl");
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(Параметры.ТабличныйДокумент);
			ДвоичныеДанные.Записать(ИмяВременногоФайла);
			ТабличныйДокумент.Прочитать(ИмяВременногоФайла);
			УдалитьФайлы(ИмяВременногоФайла);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СообщениеФайлУдален()
	
	Возврат НСтр("ru = 'Файл уже удален, возможно в другом сеансе была запущена проверка.'");
	
КонецФункции

#КонецОбласти
